# Brewfile - run with: brew bundle --file=Brewfile

# Dotfile Management
brew "stow"

# Shell & Prompt
brew "zsh"
brew "starship"

# Editors & Multiplexer
brew "neovim"
brew "tmux"

# Languages (system-wide, no version manager for now)
brew "go"
brew "node"
brew "python@3.12"
brew "goose"
brew "libpq"

# Syntax styling and linters
brew "golangci-lint"
brew "pre-commit"

# Containers & K8s
brew "colima"
brew "docker"
brew "docker-compose"
brew "kubectl"
brew "kubectx"
brew "helm"
brew "k9s"

# Cloud
brew "awscli"
brew "aws-sam-cli"

# Git
brew "git"
brew "gh"
brew "lazygit"

# Search & Productivity
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "zoxide"
brew "jq"
brew "yq"
brew "tldr"
brew "htop"
brew "tree"

# Docker TUI
brew "lazydocker"

# Fonts
cask "font-hack-nerd-font"

# Apps
cask "1password-cli"
cask "ghostty"
cask "claude-code"
